## Staging: ses_receiving_emails
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.ses_receiving_emails_testing will be created
  + resource "aws_cloudwatch_event_rule" "ses_receiving_emails_testing" {
      + arn                 = (known after apply)
      + description         = "ses_receiving_emails_testing event rule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "ses_receiving_emails_testing"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.ses_receiving_emails will be created
  + resource "aws_cloudwatch_event_target" "ses_receiving_emails" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.ses_receiving_emails-500-errors-api will be created
  + resource "aws_cloudwatch_log_metric_filter" "ses_receiving_emails-500-errors-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ses_receiving_emails"
      + name           = "ses_receiving_emails-500-errors-api"
      + pattern        = "\"\\\"levelname\\\": \\\"ERROR\\\"\""

      + metric_transformation {
          + name      = "500-errors-ses_receiving_emails-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_receiving_emails-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-ses_receiving_emails-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One 500 error in 1 minute for ses_receiving_emails api"
      + alarm_name                            = "logs-1-500-error-1-minute-warning-ses_receiving_emails-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-ses_receiving_emails-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_ecr_repository.ses_receiving_emails will be created
  + resource "aws_ecr_repository" "ses_receiving_emails" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "notify/ses_receiving_emails"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_lambda_function_event_invoke_config.ses_receiving_emails_invoke_config will be created
  + resource "aws_lambda_function_event_invoke_config" "ses_receiving_emails_invoke_config" {
      + function_name                = "ses_receiving_emails"
      + id                           = (known after apply)
      + maximum_event_age_in_seconds = 60
      + maximum_retry_attempts       = 0
    }

  # aws_lambda_permission.ses_receiving_emails_allow_cloudwatch will be created
  + resource "aws_lambda_permission" "ses_receiving_emails_allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ses_receiving_emails"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.ses_receiving_emails.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.ses_receiving_emails.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ses_receiving_emails_non_vpc"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.ses_receiving_emails.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ses_receiving_emails"
    }

  # module.ses_receiving_emails.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "ses_receiving_emails"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::239043911459:role/ses_receiving_emails"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CELERY_QUEUE_PREFIX"     = "eks-notification-canada-ca"
              + "GC_NOTIFY_SERVICE_EMAIL" = "gc.notify.gc.notification@staging.notification.cdssandbox.xyz"
              + "NOTIFY_SENDING_DOMAIN"   = "staging.notification.cdssandbox.xyz"
              + "SQS_REGION"              = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>